; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s4-p2-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 - city
          t0 t1 - truck
          l0-0 l1-0 - airport
          l0-1 l0-2 l0-3 l1-1 l1-2 l1-3 - location
          p0 p1 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l0-2 c0)
    (in-city  l0-3 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l1-2 c1)
    (in-city  l1-3 c1)
    (at t0 l0-3)
    (at t1 l1-0)
    (at p0 l1-3)
    (at p1 l1-1)
    (at a0 l1-0)
)

(:goal
    (and
        (at p0 l1-3)
        (at p1 l0-3)
    )
)
)

; plan
1. (drive t0 l0-3 l0-1)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 1 of 2
2. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 2
3. (load t1 p1 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t1)
   goals met: 1 of 2
4. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 2
5. (unload t1 p1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 1 of 2
6. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 2
7. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 2
8. (load a0 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 1 of 2
9. (drive t0 l0-0 l0-3)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 1 of 2
10. (drive t0 l0-3 l0-1)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 1 of 2
11. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 1 of 2
12. (drive t0 l0-1 l0-3)
   deleted: (at t0 l0-1)
   added: (at t0 l0-3)
   goals met: 1 of 2
13. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 2
14. (drive t0 l0-3 l0-0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 1 of 2
15. (drive t1 l1-0 l1-2)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 1 of 2
16. (unload a0 p1 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 1 of 2
17. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 1 of 2
18. (drive t1 l1-2 l1-1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 1 of 2
19. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 1 of 2
20. (load t0 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 1 of 2
21. (drive t0 l0-0 l0-3)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 1 of 2
22. (drive t1 l1-1 l1-2)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 1 of 2
23. (unload t0 p1 l0-3)
   deleted: (in p1 t0)
   added: (at p1 l0-3)
   goals met: 2 of 2
